In [1]:
import pandas as pd
import numpy as np

In [6]:
authors=pd.DataFrame({'author_id':[1,2,3], 
                      'author_name':['Тургенев', 'Чехов', 'Островский']}, 
                     columns=['author_id', 'author_name'])

In [8]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [13]:
book=pd.DataFrame({'author_id':[1,1,1,2,2,3,3], 
                   'book_title':['Отцы и дети', 
                                 'Рудин', 
                                 'Дворянское гнездо', 
                                 'Толстый и тонкий', 
                                 'Дама с собачкой',
                                'Гроза',
                                'Таланты и поклонники'], 
                                 'price':[450, 300, 350, 500, 450, 370, 290]}, 
                  columns=['author_id', 'book_title', 'price'])

In [14]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [22]:
authors_price=pd.merge(authors, book, on = 'author_id', how='left')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [36]:
author_name=authors_price['author_name'].unique()
min_price=authors_price.groupby('author_name')['price'].min()
min_price

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [53]:
max_price=authors_price.groupby('author_name')['price'].max()
max_price

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [62]:
min_price=authors_price.groupby('author_name').agg({'price': 'min'})
min_price

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [63]:
max_price=authors_price.groupby('author_name').agg({'price': 'max'})
min_price

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [66]:
mean_price=authors_price.groupby('author_name').agg({'price': 'mean'})
mean_price

                  price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [71]:
authors_stat1=pd.merge(min_price, max_price, on = 'author_name', how='inner')
authors_stat1

             price_x  price_y
author_name
Островский       290      370
Тургенев         300      450
Чехов            450      500

In [73]:
authors_stat=pd.merge(authors_stat1, mean_price, on = 'author_name', how='inner')
authors_stat

             price_x  price_y       price
author_name
Островский       290      370  330.000000
Тургенев         300      450  366.666667
Чехов            450      500  475.000000

In [77]:
authors_stat=authors_stat.rename(columns={'price_x':'min_price', 'price_y':'max_price', 'price':'mean_price'})
authors_stat

             min_price  price_max  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000